# DentalYOLO26m v2 lite - based on yolo26m-p2 with smaller dental replacements.
#
# Differences from dental-yolo26m.yaml:
#   - Keep early stem/downsample layers as stock Conv for better pretrained transfer.
#   - Use LATDAA with fewer anchors (16 instead of 32).
#   - Use lighter DRELAN blocks in the head (n=1 instead of n=2).

# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]           # 2
  - [-1, 1, Conv, [256, 3, 2]]                  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]           # 4
  - [-1, 1, Conv, [512, 3, 2]]                  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                  # 6
  - [-1, 1, Conv, [1024, 3, 2]]                 # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]                 # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]           # 9
  - [-1, 1, LATDAA, [1024, 4, 16]]              # 10, lighter than K=32

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12 cat backbone P4
  - [-1, 2, C3k2, [512, True]]                  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15 cat backbone P3
  - [-1, 1, DRELAN, [256, 1]]                   # 16 lighter P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 2], 1, Concat, [1]]                   # 18 cat backbone P2
  - [-1, 2, C3k2, [128, True]]                  # 19 P2/4-xsmall

  - [-1, 1, Conv, [128, 3, 2]]                  # 20
  - [[-1, 16], 1, Concat, [1]]                  # 21 cat head P3
  - [-1, 1, DRELAN, [256, 1]]                   # 22 lighter P3

  - [-1, 1, Conv, [256, 3, 2]]                  # 23
  - [[-1, 13], 1, Concat, [1]]                  # 24 cat head P4
  - [-1, 2, C3k2, [512, True]]                  # 25 P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                  # 26
  - [[-1, 10], 1, Concat, [1]]                  # 27 cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]      # 28 P5/32-large

  - [[19, 22, 25, 28], 1, Detect, [nc]]         # 29 Detect(P2, P3, P4, P5)
